"use strict";

let questions = [{
        text: 'Какое растение существует на самом деле?',
        variants: {
            'a': 'Лох чилийский',
            'b': 'Лох индийский',
            'c': 'Лох греческий',
            'd': 'Лох русский',
        },
        correctAnswerIndex: 'b',
    },
    {
        text: 'Что за место, попав в которое, человек делает селфи на кухне, которую не может себе позволить?',
        variants: {
            'a': 'Рим',
            'b': 'Париж',
            'c': 'Лондон',
            'd': 'Икея',
        },
        correctAnswerIndex: 'd',
    },
    {
        text: 'Какой город объявлен официальной родиной русского Деда Мороза?',
        variants: {
            'a': 'Малая Вишера',
            'b': 'Великий Устюг',
            'c': 'Вышний Волочек',
            'd': 'Нижний Новгород',
        },
        correctAnswerIndex: 'b',
    },
    {
        text: 'Что проводит боксер, наносящий удар противнику снизу?',
        variants: {
            'a': 'Свинг',
            'b': 'Хук',
            'c': 'Апперкот',
            'd': 'Джэб',
        },
        correctAnswerIndex: 'c',
    },
    {
        text: 'К кому первому обратились за помощью дед и бабка, не справившись с репкой?',
        variants: {
            'a': 'К Жучке',
            'b': 'К дочке',
            'c': 'К внучке',
            'd': 'К залу',
        },
        correctAnswerIndex: 'c',
    },
]